### List of Changed Stacks

```bash
stacks/original
exitcode=0
stdout<<EOF
stacks/original
EOF
stderr<<EOF
EOF
```

#### Terraform Plan

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_autoscaling_group.slave_asg will be created
  + resource "aws_autoscaling_group" "slave_asg" {
      + arn                              = (known after apply)
      + availability_zones               = [
          + "us-east-1a",
          + "us-east-1b",
        ]
      + default_cooldown                 = (known after apply)
      + desired_capacity                 = 2
      + force_delete                     = false
      + force_delete_warm_pool           = false
      + health_check_grace_period        = 300
      + health_check_type                = (known after apply)
      + id                               = (known after apply)
      + ignore_failed_scaling_activities = false
      + load_balancers                   = (known after apply)
      + max_size                         = 2
      + metrics_granularity              = "1Minute"
      + min_size                         = 0
      + name                             = "original_implementation_asg"
      + name_prefix                      = (known after apply)
      + predicted_capacity               = (known after apply)
      + protect_from_scale_in            = false
      + service_linked_role_arn          = (known after apply)
      + target_group_arns                = (known after apply)
      + vpc_zone_identifier              = (known after apply)
      + wait_for_capacity_timeout        = "10m"
      + warm_pool_size                   = (known after apply)

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = "$Latest"
        }
    }

  # aws_instance.master_instance will be created
  + resource "aws_instance" "master_instance" {
      + ami                                  = "ami-07caf09b362be10b8"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Client" = "original_implementation"
          + "Name"   = "original_implementation_master_instance"
        }
      + tags_all                             = {
          + "Client" = "original_implementation"
          + "Name"   = "original_implementation_master_instance"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)
    }

  # aws_launch_template.slave_launch_template will be created
  + resource "aws_launch_template" "slave_launch_template" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + id                     = (known after apply)
      + image_id               = "ami-07caf09b362be10b8"
      + instance_type          = "t2.micro"
      + latest_version         = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "original_implementation_template"
      + tags_all               = (known after apply)
      + vpc_security_group_ids = (known after apply)

      + tag_specifications {
          + resource_type = "instance"
          + tags          = {
              + "Client" = "original_implementation"
              + "Name"   = "original_implementation"
            }
        }
    }

  # aws_security_group.master_sg will be created
  + resource "aws_security_group" "master_sg" {
      + arn                    = (known after apply)
      + description            = "Allow inbound traffic and all outbound traffic to the master of original_implementation"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "original_implementation_master_sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Client" = "original_implementation"
          + "Name"   = "original_implementation_master_sg"
        }
      + tags_all               = {
          + "Client" = "original_implementation"
          + "Name"   = "original_implementation_master_sg"
        }
      + vpc_id                 = "vpc-08c07fc88ec42d090"
    }

  # aws_security_group.slave_sg will be created
  + resource "aws_security_group" "slave_sg" {
      + arn                    = (known after apply)
      + description            = "Segurity group for the slave structure of the client original_implementation"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "original_implementation_slave_sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Client" = "original_implementation"
          + "Name"   = "original_implementation_slave_sg"
        }
      + tags_all               = {
          + "Client" = "original_implementation"
          + "Name"   = "original_implementation_slave_sg"
        }
      + vpc_id                 = "vpc-08c07fc88ec42d090"
    }

  # aws_subnet.original_subnet will be created
  + resource "aws_subnet" "original_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = (known after apply)
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.31.144.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Client" = "original_implementation"
          + "Name"   = "original_implementation_master_subnet"
        }
      + tags_all                                       = {
          + "Client" = "original_implementation"
          + "Name"   = "original_implementation_master_subnet"
        }
      + vpc_id                                         = "vpc-08c07fc88ec42d090"
    }

  # aws_vpc_security_group_egress_rule.allow_slave_egress will be created
  + resource "aws_vpc_security_group_egress_rule" "allow_slave_egress" {
      + arn                          = (known after apply)
      + id                           = (known after apply)
      + ip_protocol                  = "-1"
      + referenced_security_group_id = (known after apply)
      + security_group_id            = (known after apply)
      + security_group_rule_id       = (known after apply)
      + tags_all                     = {}
    }

  # aws_vpc_security_group_egress_rule.egress_from_master_sg will be created
  + resource "aws_vpc_security_group_egress_rule" "egress_from_master_sg" {
      + arn                          = (known after apply)
      + description                  = "Egress rule that allow the slave to communicate with the master instance"
      + id                           = (known after apply)
      + ip_protocol                  = "-1"
      + referenced_security_group_id = (known after apply)
      + security_group_id            = (known after apply)
      + security_group_rule_id       = (known after apply)
      + tags_all                     = {}
    }

  # aws_vpc_security_group_ingress_rule.allow_internet_traffic_global will be created
  + resource "aws_vpc_security_group_ingress_rule" "allow_internet_traffic_global" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags_all               = {}
    }

  # aws_vpc_security_group_ingress_rule.allow_slave_ingress will be created
  + resource "aws_vpc_security_group_ingress_rule" "allow_slave_ingress" {
      + arn                          = (known after apply)
      + id                           = (known after apply)
      + ip_protocol                  = "-1"
      + referenced_security_group_id = (known after apply)
      + security_group_id            = (known after apply)
      + security_group_rule_id       = (known after apply)
      + tags_all                     = {}
    }

  # aws_vpc_security_group_ingress_rule.ingress_from_master_sg will be created
  + resource "aws_vpc_security_group_ingress_rule" "ingress_from_master_sg" {
      + arn                          = (known after apply)
      + description                  = "Ingress rule that allow the slave to communicate with the master instance"
      + id                           = (known after apply)
      + ip_protocol                  = "-1"
      + referenced_security_group_id = (known after apply)
      + security_group_id            = (known after apply)
      + security_group_rule_id       = (known after apply)
      + tags_all                     = {}
    }

  # module.master-module.aws_instance.master_instance will be destroyed
  # (because aws_instance.master_instance is not in configuration)
  - resource "aws_instance" "master_instance" {
      - ami                                  = "ami-07caf09b362be10b8" -> null
      - arn                                  = "arn:aws:ec2:us-east-1:295093822487:instance/i-0d211f1145f1c3bfb" -> null
      - associate_public_ip_address          = false -> null
      - availability_zone                    = "us-east-1d" -> null
      - cpu_core_count                       = 1 -> null
      - cpu_threads_per_core                 = 1 -> null
      - disable_api_stop                     = false -> null
      - disable_api_termination              = false -> null
      - ebs_optimized                        = false -> null
      - get_password_data                    = false -> null
      - hibernation                          = false -> null
      - id                                   = "i-0d211f1145f1c3bfb" -> null
      - instance_initiated_shutdown_behavior = "stop" -> null
      - instance_state                       = "running" -> null
      - instance_type                        = "t2.small" -> null
      - ipv6_address_count                   = 0 -> null
      - ipv6_addresses                       = [] -> null
      - monitoring                           = false -> null
      - placement_partition_number           = 0 -> null
      - primary_network_interface_id         = "eni-0938cf8c220118331" -> null
      - private_dns                          = "ip-172-31-139-143.ec2.internal" -> null
      - private_ip                           = "172.31.139.143" -> null
      - secondary_private_ips                = [] -> null
      - security_groups                      = [
          - "client-1_master_sg",
        ] -> null
      - source_dest_check                    = true -> null
      - subnet_id                            = "subnet-066d0bddfd2c1c8ce" -> null
      - tags                                 = {
          - "Client" = "client-1"
          - "Name"   = "client-1_master_instance"
        } -> null
      - tags_all                             = {
          - "Client" = "client-1"
          - "Name"   = "client-1_master_instance"
        } -> null
      - tenancy                              = "default" -> null
      - user_data_replace_on_change          = false -> null
      - vpc_security_group_ids               = [
          - "sg-05998f58d3f29155b",
        ] -> null

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - cpu_options {
          - core_count       = 1 -> null
          - threads_per_core = 1 -> null
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_protocol_ipv6          = "disabled" -> null
          - http_put_response_hop_limit = 2 -> null
          - http_tokens                 = "required" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/xvda" -> null
          - encrypted             = false -> null
          - iops                  = 3000 -> null
          - tags                  = {} -> null
          - tags_all              = {} -> null
          - throughput            = 125 -> null
          - volume_id             = "vol-02bbe61de12cc856f" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp3" -> null
        }
    }

  # module.master-module.aws_subnet.master_public_subnet will be destroyed
  # (because aws_subnet.master_public_subnet is not in configuration)
  - resource "aws_subnet" "master_public_subnet" {
      - arn                                            = "arn:aws:ec2:us-east-1:295093822487:subnet/subnet-066d0bddfd2c1c8ce" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-east-1d" -> null
      - availability_zone_id                           = "use1-az1" -> null
      - cidr_block                                     = "172.31.128.0/20" -> null
      - enable_dns64                                   = false -> null
      - enable_lni_at_device_index                     = 0 -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-066d0bddfd2c1c8ce" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "295093822487" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Client" = "client-1"
          - "Name"   = "client-1_master_subnet"
        } -> null
      - tags_all                                       = {
          - "Client" = "client-1"
          - "Name"   = "client-1_master_subnet"
        } -> null
      - vpc_id                                         = "vpc-08c07fc88ec42d090" -> null
    }

  # module.master-module.aws_vpc_security_group_egress_rule.allow_slave_egress will be destroyed
  # (because aws_vpc_security_group_egress_rule.allow_slave_egress is not in configuration)
  - resource "aws_vpc_security_group_egress_rule" "allow_slave_egress" {
      - arn                          = "arn:aws:ec2:us-east-1:295093822487:security-group-rule/sgr-017312a9e5f539ddd" -> null
      - id                           = "sgr-017312a9e5f539ddd" -> null
      - ip_protocol                  = "-1" -> null
      - referenced_security_group_id = "sg-05f57f693459c45c0" -> null
      - security_group_id            = "sg-05998f58d3f29155b" -> null
      - security_group_rule_id       = "sgr-017312a9e5f539ddd" -> null
      - tags_all                     = {} -> null
    }

  # module.master-module.aws_vpc_security_group_ingress_rule.allow_internet_traffic_global will be destroyed
  # (because aws_vpc_security_group_ingress_rule.allow_internet_traffic_global is not in configuration)
  - resource "aws_vpc_security_group_ingress_rule" "allow_internet_traffic_global" {
      - arn                    = "arn:aws:ec2:us-east-1:295093822487:security-group-rule/sgr-00381b358ebdee2f7" -> null
      - cidr_ipv4              = "0.0.0.0/0" -> null
      - id                     = "sgr-00381b358ebdee2f7" -> null
      - ip_protocol            = "-1" -> null
      - security_group_id      = "sg-05998f58d3f29155b" -> null
      - security_group_rule_id = "sgr-00381b358ebdee2f7" -> null
      - tags_all               = {} -> null
    }

  # module.master-module.aws_vpc_security_group_ingress_rule.allow_slave_ingress will be destroyed
  # (because aws_vpc_security_group_ingress_rule.allow_slave_ingress is not in configuration)
  - resource "aws_vpc_security_group_ingress_rule" "allow_slave_ingress" {
      - arn                          = "arn:aws:ec2:us-east-1:295093822487:security-group-rule/sgr-048e49d3e570210d5" -> null
      - id                           = "sgr-048e49d3e570210d5" -> null
      - ip_protocol                  = "-1" -> null
      - referenced_security_group_id = "sg-05f57f693459c45c0" -> null
      - security_group_id            = "sg-05998f58d3f29155b" -> null
      - security_group_rule_id       = "sgr-048e49d3e570210d5" -> null
      - tags_all                     = {} -> null
    }

  # module.sg.aws_security_group.master_sg will be destroyed
  # (because aws_security_group.master_sg is not in configuration)
  - resource "aws_security_group" "master_sg" {
      - arn                    = "arn:aws:ec2:us-east-1:295093822487:security-group/sg-05998f58d3f29155b" -> null
      - description            = "Allow inbound traffic and all outbound traffic to the master of client-1" -> null
      - egress                 = [
          - {
              - cidr_blocks      = []
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = [
                  - "sg-05f57f693459c45c0",
                ]
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-05998f58d3f29155b" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = [
                  - "sg-05f57f693459c45c0",
                ]
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - name                   = "client-1_master_sg" -> null
      - owner_id               = "295093822487" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Client" = "client-1"
          - "Name"   = "client-1_master_sg"
        } -> null
      - tags_all               = {
          - "Client" = "client-1"
          - "Name"   = "client-1_master_sg"
        } -> null
      - vpc_id                 = "vpc-08c07fc88ec42d090" -> null
    }

  # module.sg.aws_security_group.slave_sg will be destroyed
  # (because aws_security_group.slave_sg is not in configuration)
  - resource "aws_security_group" "slave_sg" {
      - arn                    = "arn:aws:ec2:us-east-1:295093822487:security-group/sg-05f57f693459c45c0" -> null
      - description            = "Segurity group for the slave structure of the client client-1" -> null
      - egress                 = [
          - {
              - cidr_blocks      = []
              - description      = "Egress rule that allow the slave to communicate with the master instance"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = [
                  - "sg-05998f58d3f29155b",
                ]
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-05f57f693459c45c0" -> null
      - ingress                = [
          - {
              - cidr_blocks      = []
              - description      = "Ingress rule that allow the slave to communicate with the master instance"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = [
                  - "sg-05998f58d3f29155b",
                ]
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - name                   = "client-1_slave_sg" -> null
      - owner_id               = "295093822487" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Client" = "client-1"
          - "Name"   = "client-1_slave_sg"
        } -> null
      - tags_all               = {
          - "Client" = "client-1"
          - "Name"   = "client-1_slave_sg"
        } -> null
      - vpc_id                 = "vpc-08c07fc88ec42d090" -> null
    }

  # module.slave-module.aws_autoscaling_group.slave_asg will be destroyed
  # (because aws_autoscaling_group.slave_asg is not in configuration)
  - resource "aws_autoscaling_group" "slave_asg" {
      - arn                              = "arn:aws:autoscaling:us-east-1:295093822487:autoScalingGroup:55a447b8-b1f6-4ec3-831d-0906c8f4fb10:autoScalingGroupName/client-1-rer_asg" -> null
      - availability_zones               = [
          - "us-east-1a",
          - "us-east-1b",
        ] -> null
      - capacity_rebalance               = false -> null
      - default_cooldown                 = 300 -> null
      - default_instance_warmup          = 0 -> null
      - desired_capacity                 = 2 -> null
      - enabled_metrics                  = [] -> null
      - force_delete                     = false -> null
      - force_delete_warm_pool           = false -> null
      - health_check_grace_period        = 300 -> null
      - health_check_type                = "EC2" -> null
      - id                               = "client-1-rer_asg" -> null
      - ignore_failed_scaling_activities = false -> null
      - load_balancers                   = [] -> null
      - max_instance_lifetime            = 0 -> null
      - max_size                         = 5 -> null
      - metrics_granularity              = "1Minute" -> null
      - min_size                         = 0 -> null
      - name                             = "client-1-rer_asg" -> null
      - predicted_capacity               = 0 -> null
      - protect_from_scale_in            = false -> null
      - service_linked_role_arn          = "arn:aws:iam::295093822487:role/aws-service-role/autoscaling.amazonaws.com/AWSServiceRoleForAutoScaling" -> null
      - suspended_processes              = [] -> null
      - target_group_arns                = [] -> null
      - termination_policies             = [] -> null
      - vpc_zone_identifier              = [] -> null
      - wait_for_capacity_timeout        = "10m" -> null
      - warm_pool_size                   = 0 -> null

      - launch_template {
          - id      = "lt-0592bf1b6f9efdcb0" -> null
          - name    = "client-1-rer_template20240509170451543200000002" -> null
          - version = "$Latest" -> null
        }
    }

  # module.slave-module.aws_launch_template.slave_launch_template will be destroyed
  # (because aws_launch_template.slave_launch_template is not in configuration)
  - resource "aws_launch_template" "slave_launch_template" {
      - arn                     = "arn:aws:ec2:us-east-1:295093822487:launch-template/lt-0592bf1b6f9efdcb0" -> null
      - default_version         = 1 -> null
      - disable_api_stop        = false -> null
      - disable_api_termination = false -> null
      - id                      = "lt-0592bf1b6f9efdcb0" -> null
      - image_id                = "ami-07caf09b362be10b8" -> null
      - instance_type           = "t2.micro" -> null
      - latest_version          = 1 -> null
      - name                    = "client-1-rer_template20240509170451543200000002" -> null
      - name_prefix             = "client-1-rer_template" -> null
      - security_group_names    = [] -> null
      - tags                    = {} -> null
      - tags_all                = {} -> null
      - vpc_security_group_ids  = [
          - "sg-05f57f693459c45c0",
        ] -> null

      - tag_specifications {
          - resource_type = "instance" -> null
          - tags          = {
              - "Client" = "client-1-rer"
              - "Name"   = "client-1-rer"
            } -> null
        }
    }

  # module.slave-module.aws_subnet.slave_public_subnet will be destroyed
  # (because aws_subnet.slave_public_subnet is not in configuration)
  - resource "aws_subnet" "slave_public_subnet" {
      - arn                                            = "arn:aws:ec2:us-east-1:295093822487:subnet/subnet-05624ae6f2cb7dc2a" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-east-1b" -> null
      - availability_zone_id                           = "use1-az4" -> null
      - cidr_block                                     = "172.31.112.0/20" -> null
      - enable_dns64                                   = false -> null
      - enable_lni_at_device_index                     = 0 -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-05624ae6f2cb7dc2a" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "295093822487" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Name" = "client-1-rer_slave_subnet"
        } -> null
      - tags_all                                       = {
          - "Name" = "client-1-rer_slave_subnet"
        } -> null
      - vpc_id                                         = "vpc-08c07fc88ec42d090" -> null
    }

  # module.slave-module.aws_vpc_security_group_egress_rule.egress_from_master_sg will be destroyed
  # (because aws_vpc_security_group_egress_rule.egress_from_master_sg is not in configuration)
  - resource "aws_vpc_security_group_egress_rule" "egress_from_master_sg" {
      - arn                          = "arn:aws:ec2:us-east-1:295093822487:security-group-rule/sgr-07fbafd7b6856afdc" -> null
      - description                  = "Egress rule that allow the slave to communicate with the master instance" -> null
      - id                           = "sgr-07fbafd7b6856afdc" -> null
      - ip_protocol                  = "-1" -> null
      - referenced_security_group_id = "sg-05998f58d3f29155b" -> null
      - security_group_id            = "sg-05f57f693459c45c0" -> null
      - security_group_rule_id       = "sgr-07fbafd7b6856afdc" -> null
      - tags_all                     = {} -> null
    }

  # module.slave-module.aws_vpc_security_group_ingress_rule.ingress_from_master_sg will be destroyed
  # (because aws_vpc_security_group_ingress_rule.ingress_from_master_sg is not in configuration)
  - resource "aws_vpc_security_group_ingress_rule" "ingress_from_master_sg" {
      - arn                          = "arn:aws:ec2:us-east-1:295093822487:security-group-rule/sgr-065577d9b5a6d09ee" -> null
      - description                  = "Ingress rule that allow the slave to communicate with the master instance" -> null
      - id                           = "sgr-065577d9b5a6d09ee" -> null
      - ip_protocol                  = "-1" -> null
      - referenced_security_group_id = "sg-05998f58d3f29155b" -> null
      - security_group_id            = "sg-05f57f693459c45c0" -> null
      - security_group_rule_id       = "sgr-065577d9b5a6d09ee" -> null
      - tags_all                     = {} -> null
    }

Plan: 11 to add, 0 to change, 12 to destroy.
```

<!-- Sticky Pull Request Commentterraform-plan -->